{
  "Full Stack Developer passionate about creating beautiful and functional web applications": "Full Stack Developer passionate about creating beautiful and functional web applications",
  "About": "About",
  "Skills": "Skills",
  "Projects": "Projects",
  "Project": "Project",
  "Contact": "Contact",
  "Contact Me": "Contact Me",
  "Skills & Technologies": "Skills & Technologies",
  "Featured Projects": "Featured Projects",
  "Get In Touch": "Get In Touch",
  "Email Me": "Mail Me",
  "Connect on LinkedIn": "Connect on LinkedIn",
  "Follow on GitHub": "Follow on GitHub",
  "All rights reserved": "All rights reserved",
  "View Project": "View Project",
  "Client Project": "Client Projec",
  "Maciel Suassuna | Typescript Fullstack Developer": "Maciel Suassuna | Typescript Fullstack Developer",
  "Maciel Gomes Suassuna Júnior Portfolio": "Maciel Gomes Suassuna Júnior Portfolio",
  "Professional Experience": "Professional Experience",
  "FullStack Developer": "FullStack Developer",
  "TI Specialist": "TI Specialist",
  "Back to projects": "Back to projects",
  "Technologies": "Technologies",
  "View Source Code": "View Source Code",
  "Live Demo": "Live Demo",
  "Click to see project details": "Click to see project details",
  "Technologies I've Worked With": "Technologies I've Worked With",
  "No description available": "No description available",
  "All": "All",
  "Personal": "Personal",
  "Test": "Test",
  "Client": "Client",
  "About The Client": "About The Client",
  "Academic Education": "Academic Education",
  "Academic Degree": "Academic Degree",
  "Professional Certification": "Professional Certification",
  "Specialized Course": "Specialized Course",
  "Bachelor of Computer Science": "Bachelor of Computer Science",
  "Technical IT Course": "Technical IT Course",
  "Certificates": "Certificates",
  "Professional certifications and achievements that validate my expertise and skills": "Professional certifications and achievements that validate my expertise and skills",
  "View Certificate": "View Certificate",
  "Development": "Development",
  "Design": "Design",
  "Cloud Computing": "Cloud Computing",
  "Data Science": "Data Science",
  "Languages": "Languages",
  "Other": "Other",
  "Oficial Certified EF SET 66/100 (C1 Effective Proficiency)": "Oficial Certified EF SET 66/100 (C1 Effective Proficiency)",
  "TimeUnits": {
    "years": "{count, plural, =1 {1 year} other {# years}}",
    "months": "{count, plural, =1 {1 month} other {# months}}",
    "days": "{count, plural, =1 {1 day} other {# days}}"
  },
  "A collection of personal, academic, and client projects I've worked on": "A collection of personal, academic, and client projects I've worked on",
  "fusionclinic_description": "As the sole developer of Fusion Clinic — a medical room rental marketplace — I managed the migration from a third-party system to an in-house solution. Leveraged Next.js, TypeScript, and TailwindCSS for front-end development, and Laravel for back-end maintenance, implementing key features like PIX payment integration (via external gateway). The platform served 700 users, delivering significant gains in performance, security, and customer experience.",
  "yoobe_description": "As a developer at Yoobe.co — a logistics platform connecting employees of major companies to corporate swag for performance rewards or celebrations — I contributed to the development and maintenance of the redemption e-commerce platform, supporting up to 10k simultaneous users. Leveraged Next.js, TypeScript, and TailwindCSS for performance optimization and UI enhancements, alongside tools like Docker, Git, and GCP for scalability. On the back-end, performed maintenance on the Ruby on Rails and Spree framework, ensuring seamless integration with the front-end. The platform served key clients like Pipefy, RD Station, and Yampi, maintaining stability during high-demand peaks.",
  "meetlink_description": "Developed for Natalshopping, Meetlink integrates a web admin panel with touchscreen kiosks, allowing customers to request immediate assistance with a single touch. The system uses advanced communication technologies like WebRTC to connect users to support teams via real-time video, with support for Portuguese and Brazilian Sign Language (Libras).",
  "natalshopping_description": "Located in the capital city of Rio Grande do Norte, Natalshopping stands as the second largest mall in Natal/RN, setting the standard for innovation and quality in Northeastern Brazil. With modern architecture and cutting-edge infrastructure, it features 200+ stores, a diverse food court, multiplex cinema, and integrated leisure areas. Renowned for its complete customer experience, it combines premium brands, personalized services, and cultural events that celebrate local identity. An icon of conscious consumption and a strategic meeting point for those seeking convenience, entertainment, and sophistication in one destination.",
  "cisreg_unp_description": "Academic project developed for the Software Engineering course at UNP, in collaboration with the entire class. The system serves as a digital scheduler for the university's Integrated Health Center (CIS), allowing administrators to allocate time slots for partner municipalities (e.g., São Gonçalo do Amarante). Each city purchases hourly credits (e.g., 20h/month) converted into bookable slots by their representatives through the platform. The solution optimizes access to free healthcare for the population, ensuring financial control (contracted vs used hours) and preventing scheduling overlaps. Developed using agile methodologies, it features granular authentication, integrated calendar, and utilization reports.",
  "efset_certificate_description": "Validates advanced English proficiency for academic and professional contexts. Certifies ability to understand complex texts, communicate fluently, and engage in technical discussions. Internationally recognized standardized assessment."
}
