{
  "Full Stack Developer passionate about creating beautiful and functional web applications": "Desarrollador Full Stack apasionado por crear aplicaciones web visualmente atractivas y funcionales",
  "About": "Sobre mí",
  "Skills": "Habilidades",
  "Project": "Proyecto",
  "Projects": "Proyectos",
  "Contact": "Contacto",
  "Contact Me": "Contáctame",
  "Skills & Technologies": "Habilidades y Tecnologías",
  "Featured Projects": "Proyectos destacados",
  "Get In Touch": "Ponte en contacto",
  "Email Me": "Envíame un correo",
  "Connect on LinkedIn": "Conéctate en LinkedIn",
  "Follow on GitHub": "Sígueme en GitHub",
  "All rights reserved": "Todos los derechos reservados",
  "View Project": "Ver Proyecto",
  "Client Project": "Proyecto Cliente",
  "Personal Project": "Proyecto Personal",
  "Academic Project": "Proyecto Académico",
  "Maciel Suassuna | Typescript Fullstack Developer": "Maciel Suassuna | Desarrollador Fullstack de Typescript",
  "Maciel Gomes Suassuna Júnior Portfolio": "Portafolio de Maciel Gomes Suassuna Júnior",
  "Professional Experience": "Experiencia Profesional",
  "FullStack Developer": "Desarrollador FullStack",
  "TI Specialist": "Especialista en TI",
  "Back to projects": "Volver a proyectos",
  "Technologies": "Tecnologías",
  "View Source Code": "Ver código fuente",
  "Live Demo": "Demostración en vivo",
  "Click to see project details": "Haga clic para ver los detalles del proyecto",
  "Technologies I've Worked With": "Tecnologías con las que he trabajado",
  "No description available": "No hay descripción disponible",
  "All": "Todos",
  "Personal": "Personales",
  "Academic": "Académicos",
  "Test": "Pruebas Técnicas",
  "Client": "De Clientes",
  "About The Client": "Sobre el cliente",
  "Academic Education": "Formación académica",
  "Academic Degree": "Título Universitario",
  "Professional Certification": "Certificación Profesional",
  "Specialized Course": "Curso Especializado",
  "Bachelor of Computer Science": "Licenciatura en Ciencias de la Computación",
  "Technical IT Course": "Curso Técnico en Informática",
  "Certificates": "Certificados",
  "Professional certifications and achievements that validate my expertise and skills": "Certificaciones y logros profesionales que validan mi experiencia y habilidades",
  "View Certificate": "Ver certificado",
  "Development": "Desenvolvimento",
  "Design": "Design",
  "Cloud Computing": "Computação em Cloud",
  "Data Science": "Ciência de Dados",
  "Languages": "Linguas",
  "Other": "Outros",
  "Oficial Certified EF SET 66/100 (C1 Effective Proficiency)": "Certificado Oficial EF SET 66/100 (C1 Competencia Efectiva)",
  "TimeUnits": {
    "years": "{count, plural, =1 {1 año} other {# años}}",
    "months": "{count, plural, =1 {1 mes} other {# meses}}",
    "days": "{count, plural, =1 {1 día} other {# días}}"
  },
  "A collection of personal, academic, for clients and technical tests projects I've worked on": "Una colección de proyectos personales, académicos, para clientes y de pruebas técnicas en los que he trabajado.",
  "fusionclinic_description": "Como único desarrollador de Fusion Clinic — un marketplace de alquiler de salas médicas — lideré la migración del sistema tercerizado a una solución interna. Utilicé Next.js, TypeScript y TailwindCSS en el front-end, y Laravel en el back-end, realizando mantenimientos críticos e implementando funcionalidades clave como la integración de pagos PIX (mediante pasarela externa). La plataforma atendió a 700 usuarios, logrando mejoras significativas en rendimiento, seguridad y experiencia del cliente.",
  "yoobe_description": "Como desarrollador en Yoobe.co — plataforma logística que conecta empleados de grandes empresas con obsequios corporativos para recompensas por desempeño o celebraciones — participé en el desarrollo y mantenimiento del e-commerce de canje, soportando hasta 10 mil usuarios simultáneos. Utilicé Next.js, TypeScript y TailwindCSS para optimizar rendimiento e implementar mejoras visuales, junto con herramientas como Docker, Git y GCP para escalabilidad. En el back-end, realicé mantenimiento en la estructura de Ruby on Rails y Spree, integrando el front-end de manera eficiente. La plataforma atendió a socios clave como Pipefy, RD Station y Yampi, garantizando estabilidad en picos de alta demanda.",
  "meetlink_description": "Desarrollado para Natalshopping, Meetlink integra un panel administrativo web con tótems táctiles, permitiendo a los clientes solicitar asistencia inmediata con un solo toque. El sistema utiliza tecnologías avanzadas de comunicación como WebRTC para conectar usuarios con equipos de soporte mediante video en tiempo real, con soporte para portugués y Lengua de Señas Brasileña (Libras).",
  "natalshopping_description": "Ubicado en la capital de Rio Grande do Norte, Natalshopping se posiciona como el segundo centro comercial más grande de Natal/RN, siendo referencia en innovación y calidad en el Noreste de Brasil. Con arquitectura moderna e infraestructura de última generación, ofrece 200+ tiendas, zona de comidas diversificada, cine multiplex y áreas de entretenimiento integradas. Destacado por su experiencia completa al cliente, combina marcas premium, servicios personalizados y eventos culturales que reflejan la identidad local. Un ícono del consumo consciente y punto de encuentro estratégico para quienes buscan conveniencia, entretenimiento y sofisticación en un solo lugar.",
  "cisreg_unp_description": "Proyecto académico desarrollado para la asignatura de Ingeniería de Software de la UNP, en colaboración con todo el grupo. El sistema funciona como una agenda digital para el Centro Integrado de Salud (CIS) de la universidad, permitiendo a los administradores asignar bloques de horarios a municipios asociados (ej.: São Gonçalo do Amarante). Cada municipio adquiere créditos en horas (ej.: 20h/mes) que se convierten en espacios reservables por sus representantes mediante la plataforma. La solución optimiza el acceso a consultas gratuitas para la población, garantizando control financiero (horas contratadas vs utilizadas) y previniendo superposiciones. Desarrollado con metodologías ágiles, incluye autenticación granular, calendario integrado e informes de uso.",
  "efset_certificate_description": "Avala competencia avanzada en inglés para entornos académicos y profesionales. Certifica habilidad para comprender textos complejos, comunicarse con fluidez y participar en discusiones técnicas. Evaluación estandarizada con reconocimiento internacional."
}
