{
  "Full Stack Developer passionate about creating beautiful and functional web applications": "Desenvolvedor Full Stack apaixonado por criar aplicações web visualmente agradáveis e funcionais",
  "About": "Sobre",
  "Skills": "Habilidades",
  "Project": "Projeto",
  "Projects": "Projetos",
  "Contact": "Contato",
  "Contact Me": "Fale Comigo",
  "Skills & Technologies": "Habilidades e Tecnologias",
  "Featured Projects": "Projetos em destaque",
  "Get In Touch": "Entre em contato",
  "Email Me": "Envie-me um email",
  "Connect on LinkedIn": "Conecte no Linkedin",
  "Follow on GitHub": "Siga no GitHub",
  "All rights reserved": "Todos os direitos reservados",
  "View Project": "Visualizar Projeto",
  "Client Project": "Projeto Cliente",
  "Personal Project": "Projeto Pessoal",
  "Academic Project": "Projeto Acadêmico",
  "Maciel Suassuna | Typescript Fullstack Developer": "Maciel Suassuna | Desenvolvedor Fullstack Typescript",
  "Maciel Gomes Suassuna Júnior Portfolio": "Portfólio de Maciel Gomes Suassuna Júnior",
  "Professional Experience": "Experiência Profissional",
  "FullStack Developer": "Desenvolvedor FullStack",
  "TI Specialist": "Especialista em TI",
  "Back to projects": "Retornar aos Projetos",
  "Technologies": "Tecnologias",
  "View Source Code": "Ver Código Fonte",
  "Live Demo": "Demostração ao vivo",
  "Click to see project details": "Clique para ver os detalhes do projeto",
  "Technologies I've Worked With": "Tecnologias que já trabalhei",
  "No description available": "Sem descrição disponível",
  "All": "Todos",
  "Personal": "Pessoais",
  "Academic": "Acadêmicos",
  "Test": "Testes Técnicos",
  "Client": "De Clientes",
  "About The Client": "Sobre o cliente",
  "Academic Education": "Formação Acadêmica",
  "Academic Degree": "Formação Superior",
  "Professional Certification": "Curso Técnico",
  "Specialized Course": "Especialização",
  "Bachelor of Computer Science": "Bacharelado em Ciência da Computação",
  "Technical IT Course": "Curso Técnico em Informática",
  "TimeUnits": {
    "years": "{count, plural, =1 {1 ano} other {# anos}}",
    "months": "{count, plural, =1 {1 mês} other {# meses}}",
    "days": "{count, plural, =1 {1 dia} other {# dias}}"
  },
  "A collection of personal, academic, for clients and technical tests projects I've worked on": "Uma lista de projetos pessoais, de faculdade, para clientes e teste técnicos nos quais trabalhei",
  "fusionclinic_description": "Como único desenvolvedor da plataforma Fusion Clinic — marketplace de aluguel de salas médicas — gerenciei a migração do sistema terceirizado para um modelo interno. Utilizei Next.js, TypeScript e TailwindCSS no front-end, e Laravel no back-end, realizando manutenções críticas e implementando funcionalidades como integração de pagamentos via PIX (via gateway externo). A plataforma atendeu 700 usuários, com ganhos expressivos em performance, segurança e experiência do cliente.",
  "yoobe_description": "Como desenvolvedor da Yoobe.co — plataforma de logística que conecta colaboradores de grandes empresas a brindes corporativos para recompensas por desempenho ou datas comemorativas — atuei no desenvolvimento e manutenção do e-commerce de resgate, suportando até 10 mil usuários simultâneos. Utilizei Next.js, TypeScript e TailwindCSS para otimizar desempenho e implementar melhorias visuais, além de ferramentas como Docker, Git e GCP para escalabilidade. No back-end, realizei manutenções na estrutura em Ruby on Rails e Spree, integrando-o ao front-end de forma eficiente. A plataforma atendeu grandes parceiros como Pipefy, RD Station e Yampi, garantindo estabilidade em picos de demanda.",
  "meetlink_description": "Desenvolvido para o Natalshopping, o Meetlink integra um painel administrativo web a totens touch screen, permitindo que clientes solicitem atendimento imediato com um toque. O sistema utiliza tecnologias de comunicação avançadas, como WebRTC, para conectar usuários à equipe de suporte por vídeo em tempo real, com suporte a português e Libras.",
  "natalshopping_description": "Localizado na capital potiguar, o Natalshopping consolida-se como o segundo maior shopping de Natal/RN, sendo referência em inovação e qualidade no Nordeste brasileiro. Com uma arquitetura moderna e infraestrutura de ponta, oferece mais de 200 lojas, praça de alimentação diversificada, cinema multiplex e áreas de lazer integradas. Destaca-se pela experiência completa ao cliente, combinando marcas renomadas, serviços personalizados e eventos culturais que refletem a identidade local. Um ícone do consumo consciente e ponto de encontro estratégico para quem busca conveniência, entretenimento e sofisticação em um único lugar.",
  "cisreg_unp_description": "Projeto acadêmico desenvolvido para a disciplina de Engenharia de Software da UNP, em colaboração com toda a turma. O sistema funciona como uma agenda digital para o Centro Integrado em Saúde (CIS) da universidade, permitindo que administradores aloquem blocos de horários para prefeituras parceiras (como São Gonçalo do Amarante). Cada município adquire créditos em horas (ex.: 20h/mês) que são convertidos em slots agendáveis por seus representantes via plataforma. A solução otimiza o acesso a consultas gratuitas pela população, garantindo controle financeiro (horas contratadas vs utilizadas) e prevenindo sobreposições. Desenvolvido com metodologias ágeis, inclui módulos de autenticação granular, calendário integrado e relatórios de utilização."
}
